{
  "filename_of_receptor": "The path to the receptor file. Should be .pdb file.",
  "center_x": "x-coordinate for the center of the pocket to be tested by docking. (Angstrom)",
  "center_y": "y-coordinate for the center of the pocket to be tested by docking. (Angstrom)",
  "center_z": "z-coordinate for the center of the pocket to be tested by docking. (Angstrom)",
  "size_x": "dimension of box to dock into in the x-axis (Angstrom)",
  "size_y": "dimension of box to dock into in the y-axis (Angstrom)",
  "size_z": "dimension of box to dock into in the z-axis (Angstrom)",
  "root_output_folder": "The Path to the folder which all output files will be placed",
  "source_compound_file": "PATH to the file containing the source compounds. It must be tab-delineated .smi file. These ligands will seed the first generation.",
  "filter_source_compounds": "If True source ligands from source_compound_file will be filter using the user defined filter choices prior to the 1st generation being created. If False, ligands which would fail the ligand filters could seed the 1st generation. Default is True.",
  "use_docked_source_compounds": "If True source ligands will be docked prior to seeding generation 1. If True and the source_compound file already has docking/fitness metric score in -2 column of .smi file, it will not redock but reuse the scores from the source_compound_file. If True and no fitness metric score in -2 column of .smi file, it will dock each ligand from the source_compound_file and displayed as generation 0. If False, generation 1 will be randomly seeded by the source compounds with no preference and there will be no generation 0. If performing multiple simulations using same source compounds and protein, we recommend running once this and using the generation 0 ranked file as the source_compound_file for future simulations. Default is True.",
  "start_a_new_run" :   "If False make a new folder and start a fresh simulation with Generation 0. If True find the last generation in the root_output_folder and continue to fill. Default is False.",
  "max_time_MCS_prescreen": "amount time the pre-screen MCS times out. Time out doesnt prevent mcs matching just takes what it has up to that point",
  "max_time_MCS_thorough": "amount time the thorough MCS times out. Time out doesnt prevent mcs matching just takes what it has up to that point",
  "min_atom_match_MCS" : "Determines the minimum number of atoms in common for a substructurematch. The higher the more restrictive, but the more likely for two ligands not to match",
  "protanate_step":     "Indicates if Smilesmerge uses protanated mols (if true) or deprot (if False) SmilesMerge is 10x faster when deprotanated",
  "rxn_library": "This set of reactions to be used in Mutation. If Custom, one must also provide rxn_file Path and function_group_library path. {click_chem_rxns,robust_rxns,all_rxns,Custom}",
  "rxn_library_file": "This PATH to a Custom json file of SMARTS reactions to use for Mutation. Only provide if using the Custom option for rxn_library.",
  "function_group_library": "This PATH for a dictionary of functional groups to be used for Mutation. Only provide if using the Custom option for rxn_library.",
  "complementary_mol_directory": "This PATH to the directory containing all the molecules being used to react with. The directory should contain .smi files contain SMILES of molecules containing the functional group represented by that file. Each file should be named with the same title as the functional groups described in rxn_library_file & function_group_library +.smi All Functional groups specified function_group_library must have its own .smi file. We recommend you filter these dictionaries prior to Autogrow for the Drug-likeliness and size filters you will Run Autogrow with.",
  "number_of_processors": "Number of processors to use for parallel calculations. Set to -1 for all available CPUs.",
  "multithread_mode": "Determine what style multithreading: mpi, multithreading, or serial. serial will override number_of_processors and force it to be on a single processor. {mpi,multithreading,serial}",
  "selector_choice": "This determines whether the fitness criteria are chosen by a Weighted Roulette, Ranked, or Tournament style Selector. The Rank option is a non-redundant selector. Roulette and Tournament chose without replacement and are stochastic options. Warning do not use Rank_Selector for small runs as there is potential that the number of desired ligands exceed the number of ligands to chose from. {Roulette_Selector,Rank_Selector,Tournament_Selector}",
  "tourn_size": "If using the Tournament_Selector this determines the size of each tournament. The number of ligands used for each tournament will the tourn_size * the number of considered ligands.",
  "top_mols_to_seed_first_generation": " Number of mols that seed next generation, for the first generation. Should be less than number_of_crossovers_first_generation + number_of_mutations_first_generation If not defined it will default to top_mols_to_seed_next_generation",
  "top_mols_to_seed_next_generation": "Number of mols that seed next generation, for all generations after the first. Should be less than number_of_crossovers_first_generation + number_of_mutations_first_generation",
  "diversity_mols_to_seed_first_generation": "Should be less than number_of_crossovers_first_generation + number_of_mutations_first_generation",
  "diversity_seed_depreciation_per_gen": "Each gen diversity_mols_to_seed_first_generation will decrease this amount",
  "num_generations": "The number of generations to be created.",
  "number_of_crossovers_first_generation": "The number of ligands which will be created via crossovers in the first generation. If not defined it will default to number_of_crossovers",
  "number_of_mutants_first_generation": "The number of ligands which will be created via mutation in the first generation. If not defined it will default to number_of_mutants",
  "number_elitism_advance_from_previous_gen_first_generation": "The number of ligands chosen for elitism for the first generation. These will advance from the previous generation directly into the next generation. This is purely advancing based on Docking/Rescore fitness. This does not select for diversity. If not defined it will default to number_elitism_advance_from_previous_gen",
  "number_of_crossovers":"The number of ligands which will be created via crossover in each generation besides the first",
  "number_of_mutants":"The number of ligands which will be created via mutation in each generation besides the first.",
  "number_elitism_advance_from_previous_gen": "The number of ligands chosen for elitism. These will advance from the previous generation directly into the next generation. This is purely advancing based on Docking/Rescore fitness. This does not select for diversity.",
  "redock_elite_from_previous_gen": "If True than ligands chosen via Elitism (ie advanced from last generation) will be passed through Gypsum and docked again. This provides a better exploration of conformer space but also requires more computation time. If False, advancing ligands are simply carried forward by copying the PDBQT files.",
  "LipinskiStrictFilter": "Lipinski filters for orally available drugs following Lipinski rule of fives. Filters by molecular weight, logP and number of hydrogen bond donors and acceptors. Strict implementation means a ligand must pass all requirements.",
  "LipinskiLenientFilter":"Lipinski filters for orally available drugs following Lipinski rule of fives. Filters by molecular weight, logP and number of hydrogen bond donors and acceptors. Lenient implementation means a ligand may fail all but one requirement and still passes.",
  "GhoseFilter" :    "Ghose filters for drug-likeliness; filters by molecular weight, logP and number of atoms.",
  "GhoseModifiedFilter": "Ghose filters for drug-likeliness; filters by molecular weight, logP and number of atoms. This is the same as the GhoseFilter, but the upper-bound of the molecular weight restrict is loosened from 480Da to 500Da. This is intended to be run with Lipinski Filter and to match AutoGrow 3's Ghose Filter.",
  "MozziconacciFilter" : "Mozziconacci filters for drug-likeliness; filters by the number of rotatable bonds, rings, oxygens, and halogens.",
  "VandeWaterbeemdFilter": " VandeWaterbeemd filters for drug likely to be blood brain barrier permeable. Filters by the number of molecular weight and Polar Sureface Area (PSA).",
  "PAINSFilter" :        "PAINS filters against Pan Assay Interference Compounds using substructure a search.",
  "NIHFilter":          "NIH filters against molecules with undersirable functional groups using substructure a search.",
  "BRENKFilter":        " BRENK filter for lead-likeliness, by matching common false positive molecules to the current mol.",
  "No_Filters":         "No filters will be applied to compounds.",
  "alternative_filter": "If you want to add Custom filters to the filter child classes Must be a list of lists [[name_filter1, Path/to/name_filter1.py],[name_filter2, Path/to/name_filter2.py]]",
  "conversion_choice": "Determines how .pdb files will be converted to the final format for docking. For Autodock Vina and QuickVina style docking software, files must be in .pdbqt format. MGLToolsConversion: uses MGLTools and is the recommended converter. MGLTools conversion is required for NNScore1/2 rescoring. ObabelConversion: uses commandline obabel. Easier to install but Vina docking has been optimized with MGLTools conversion. {MGLToolsConversion,ObabelConversion,Custom}",
  "custom_conversion_script":"The path to a python script for which is used to convert ligands. This is required for custom conversion_choice choices. Must be a list of strings [name_custom_conversion_class, Path/to/name_custom_conversion_class.py]",
  "mgltools_directory": "Required if using MGLTools conversion option (conversion_choice=MGLToolsConversion) Path may look like: /home/user/MGLTools-1.5.6/",
  "obabel_path": "required if using obabel conversion option (conversion_choice=ObabelConversion). Path may look like PATH/envs/py37/bin/obabel; may be found on Linux by running: which obabel",
  "dock_choice": "dock_choice assigns which docking software module to use.",
  "docking_executable": "path to the docking_executable",
  "docking_exhaustiveness": "exhaustiveness of the global search (roughly proportional to time. see docking software for settings. Unless specified Autogrow uses the docking softwares default setting. For AutoDock Vina 1.1.2 that is 8",
  "docking_num_modes": "maximum number of binding modes to generate in docking. See docking software for settings. Unless specified Autogrow uses the docking softwares default setting. For AutoDock Vina 1.1.2 that is 9",
  "docking_timeout_limit": "The maximum amount of time allowed to dock a single ligand into a pocket in seconds. Many factors influence the time required to dock, such as: processor speed, the docking software, rotatable bonds, exhaustiveness docking, and number of docking modes... The default docking_timeout_limit is 120 seconds, which is excess for most docking events using QuickVina2Docking under default settings. If run with more exhaustive settings or with highly flexible ligands, consider increasing docking_timeout_limit to accommodate. Default docking_timeout_limit is 120 seconds",
  "custom_docking_script": "The name and path to a python script for which is used to dock ligands. This is required for Custom docking choices Must be a list of strings [name_custom_conversion_class, Path/to/name_custom_conversion_class.py]",
  "scoring_choice": "The scoring_choice to use to assess the ligands docking fitness. Default is using Vina/QuickVina2 ligand affinity while NN1/NN2 use a Neural Network to assess the docking pose. Custom requires providing a file path for a Custom scoring function. If Custom scoring function, confirm it selects properly, Autogrow is largely set to select for a more negative score.",
  "rescore_lig_efficiency": "This will divide the final scoring_choice output by the number of non-Hydrogen atoms in the ligand. This adjusted ligand efficiency score will override the scoring_choice value. This is compatible with all scoring_choice options.",
  "custom_scoring_script": "The path to a python script for which is used to assess the ligands docking fitness. Autogrow is largely set to select for a most negative scores (ie binding affinity the more negative is best). Must be a list of strings [name_custom_conversion_class, Path/to/name_custom_conversion_class.py]",
  "max_variants_per_compound": "number of conformers made per ligand. See Gypsum-DL publication for details",
  "gypsum_thoroughness": "How widely Gypsum-DL will search for low-energy conformers. Larger values increase run times but can produce better results. See Gypsum-DL publication for details",
  "min_ph":          "Minimum pH to consider.See Gypsum-DL and Dimorphite-D publication for details.",
  "max_ph" :          "Maximum pH to consider.See Gypsum-DL and Dimorphite-D publication for details.",
  "pka_precision" : "Size of pH substructure ranges. See Dimorphite-DL publication for details.",
  "gypsum_timeout_limit": "Maximum time gypsum is allowed to run for a given ligand in seconds. On average Gypsum-DL takes on several seconds to run for a given ligand, but factors such as mol size, rotatable bonds, processor speed, and gypsum settings (ie gypsum_thoroughness or max_variants_per_compound) will change how long it takes to run. If increasing gypsum settings it is best to increase the gypsum_timeout_limit. Default gypsum_timeout_limit is 15 seconds",
  "reduce_files_sizes": "Run this combines all files in the PDBs folder into a single text file. Useful when data needs to be transferred.",
  "generate_plot": "Make a line plot of the simulation at the end of the run."
}